{"text": "Q:\n\nIdentifying Files in Plone BlobStorage\n\nFiles in var/blobstorage can be listed and sorted by their sizes via Unix commands. This way shows big files on top list. How can I identify these files belongs to which IDs/paths in a Plone site?\n\nA:\n\nThere is no 'supported' way to do this. You could probably write a script to inspect the ZODB storage, but it'd be complicated. If you want to find the biggest files in your Plone site, you're probably better off writing a script that runs in Plone and using it to search (using portal_catalog) for all File objects (or whatever content type is most likely to have big files) and calling get_size() on it. That should return the (cached) size, and you can delete what you want to clean up.\n\n", "meta": {"pile_set_name": "StackExchange"}}
{"text": "What If We Weren’t so Focused on Price?\n\nJanuary 1, 2011\n\nWould quality get better? Would service get better? Would there be jobs in the manufacturing sector again her in the U.S.? Would we, as consumers, then be more inclined to direct our taste to other attributes, like longevity? Would we, as retailers and retail designers, then be allowed to make things that could be appreciated purely for how they move us vs. what they cost? Would we all then be able to compete with Apple?", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "// Copyright 2018, OpenCensus Authors\n//\n// Licensed under the Apache License, Version 2.0 (the \"License\");\n// you may not use this file except in compliance with the License.\n// You may obtain a copy of the License at\n//\n//     http://www.apache.org/licenses/LICENSE-2.0\n//\n// Unless required by applicable law or agreed to in writing, software\n// distributed under the License is distributed on an \"AS IS\" BASIS,\n// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n// See the License for the specific language governing permissions and\n// limitations under the License.\n\npackage ochttp\n\nimport (\n\t\"crypto/tls\"\n\t\"net/http\"\n\t\"net/http/httptrace\"\n\t\"strings\"\n\n\t\"go.opencensus.io/trace\"\n)\n\ntype spanAnnotator struct {\n\tsp *trace.Span\n}\n\n// TODO: Remove NewSpanAnnotator at the next release.\n\n// NewSpanAnnotator returns a httptrace.ClientTrace which annotates\n// all emitted httptrace events on the provided Span.\n// Deprecated: Use NewSpanAnnotatingClientTrace instead\nfunc NewSpanAnnotator(r *http.Request, s *trace.Span) *httptrace.ClientTrace {\n\treturn NewSpanAnnotatingClientTrace(r, s)\n}\n\n// NewSpanAnnotatingClientTrace returns a httptrace.ClientTrace which annotates\n// all emitted httptrace events on the provided Span.\nfunc NewSpanAnnotatingClientTrace(_ *http.Request, s *trace.Span) *httptrace.ClientTrace {\n\tsa := spanAnnotator{sp: s}\n\n\treturn &httptrace.ClientTrace{\n\t\tGetConn:              sa.getConn,\n\t\tGotConn:              sa.gotConn,\n\t\tPutIdleConn:          sa.putIdleConn,\n\t\tGotFirstResponseByte: sa.gotFirstResponseByte,\n\t\tGot100Continue:       sa.got100Continue,\n\t\tDNSStart:             sa.dnsStart,\n\t\tDNSDone:              sa.dnsDone,\n\t\tConnectStart:         sa.connectStart,\n\t\tConnectDone:          sa.connectDone,\n\t\tTLSHandshakeStart:    sa.tlsHandshakeStart,\n\t\tTLSHandshakeDone:     sa.tlsHandshakeDone,\n\t\tWroteHeaders:         sa.wroteHeaders,\n\t\tWait100Continue:      sa.wait100Continue,\n\t\tWroteRequest:         sa.wroteRequest,\n\t}\n}\n\nfunc (s spanAnnotator) getConn(hostPort string) {\n\tattrs := []trace.Attribute{\n\t\ttrace.StringAttribute(\"httptrace.get_connection.host_port\", hostPort),\n\t}\n\ts.sp.Annotate(attrs, \"GetConn\")\n}\n\nfunc (s spanAnnotator) gotConn(info httptrace.GotConnInfo) {\n\tattrs := []trace.Attribute{\n\t\ttrace.BoolAttribute(\"httptrace.got_connection.reused\", info.Reused),\n\t\ttrace.BoolAttribute(\"httptrace.got_connection.was_idle\", info.WasIdle),\n\t}\n\tif info.WasIdle {\n\t\tattrs = append(attrs,\n\t\t\ttrace.StringAttribute(\"httptrace.got_connection.idle_time\", info.IdleTime.String()))\n\t}\n\ts.sp.Annotate(attrs, \"GotConn\")\n}\n\n// PutIdleConn implements a httptrace.ClientTrace hook\nfunc (s spanAnnotator) putIdleConn(err error) {\n\tvar attrs []trace.Attribute\n\tif err != nil {\n\t\tattrs = append(attrs,\n\t\t\ttrace.StringAttribute(\"httptrace.put_idle_connection.error\", err.Error()))\n\t}\n\ts.sp.Annotate(attrs, \"PutIdleConn\")\n}\n\nfunc (s spanAnnotator) gotFirstResponseByte() {\n\ts.sp.Annotate(nil, \"GotFirstResponseByte\")\n}\n\nfunc (s spanAnnotator) got100Continue() {\n\ts.sp.Annotate(nil, \"Got100Continue\")\n}\n\nfunc (s spanAnnotator) dnsStart(info httptrace.DNSStartInfo) {\n\tattrs := []trace.Attribute{\n\t\ttrace.StringAttribute(\"httptrace.dns_start.host\", info.Host),\n\t}\n\ts.sp.Annotate(attrs, \"DNSStart\")\n}\n\nfunc (s spanAnnotator) dnsDone(info httptrace.DNSDoneInfo) {\n\tvar addrs []string\n\tfor _, addr := range info.Addrs {\n\t\taddrs = append(addrs, addr.String())\n\t}\n\tattrs := []trace.Attribute{\n\t\ttrace.StringAttribute(\"httptrace.dns_done.addrs\", strings.Join(addrs, \" , \")),\n\t}\n\tif info.Err != nil {\n\t\tattrs = append(attrs,\n\t\t\ttrace.StringAttribute(\"httptrace.dns_done.error\", info.Err.Error()))\n\t}\n\ts.sp.Annotate(attrs, \"DNSDone\")\n}\n\nfunc (s spanAnnotator) connectStart(network, addr string) {\n\tattrs := []trace.Attribute{\n\t\ttrace.StringAttribute(\"httptrace.connect_start.network\", network),\n\t\ttrace.StringAttribute(\"httptrace.connect_start.addr\", addr),\n\t}\n\ts.sp.Annotate(attrs, \"ConnectStart\")\n}\n\nfunc (s spanAnnotator) connectDone(network, addr string, err error) {\n\tattrs := []trace.Attribute{\n\t\ttrace.StringAttribute(\"httptrace.connect_done.network\", network),\n\t\ttrace.StringAttribute(\"httptrace.connect_done.addr\", addr),\n\t}\n\tif err != nil {\n\t\tattrs = append(attrs,\n\t\t\ttrace.StringAttribute(\"httptrace.connect_done.error\", err.Error()))\n\t}\n\ts.sp.Annotate(attrs, \"ConnectDone\")\n}\n\nfunc (s spanAnnotator) tlsHandshakeStart() {\n\ts.sp.Annotate(nil, \"TLSHandshakeStart\")\n}\n\nfunc (s spanAnnotator) tlsHandshakeDone(_ tls.ConnectionState, err error) {\n\tvar attrs []trace.Attribute\n\tif err != nil {\n\t\tattrs = append(attrs,\n\t\t\ttrace.StringAttribute(\"httptrace.tls_handshake_done.error\", err.Error()))\n\t}\n\ts.sp.Annotate(attrs, \"TLSHandshakeDone\")\n}\n\nfunc (s spanAnnotator) wroteHeaders() {\n\ts.sp.Annotate(nil, \"WroteHeaders\")\n}\n\nfunc (s spanAnnotator) wait100Continue() {\n\ts.sp.Annotate(nil, \"Wait100Continue\")\n}\n\nfunc (s spanAnnotator) wroteRequest(info httptrace.WroteRequestInfo) {\n\tvar attrs []trace.Attribute\n\tif info.Err != nil {\n\t\tattrs = append(attrs,\n\t\t\ttrace.StringAttribute(\"httptrace.wrote_request.error\", info.Err.Error()))\n\t}\n\ts.sp.Annotate(attrs, \"WroteRequest\")\n}\n", "meta": {"pile_set_name": "Github"}}
{"text": "Jon Porras\n\nBlack Mesa\n\nOn the surface, there’s very little that Jon Porras’ Black Mesa and Dustin Wong’s Dreams Say, View, Create, Shadow Leads have in common. They’re both works for solo guitar. They’re both on Thrill Jockey. (Who, it’s got to be said, is putting out records of solo guitar at a time when most labels are trying to recoup basic pressing costs with t-shirts sales. Kudos to them for stubbornly sticking to their aesthetic guns.) I guess that’s about it.\n\nIncredible, then, that such disparate work can come from a single instrument, as if reasserting the vital flexibility of a guitar in the right hands. Listen to these two albums, both quite good, side by side. Wong’s guitar work is polyphonic, Porras’ a monologue. Where Wong constructs busy arrangements of crystalline intensity, Porras lets the lone, meditative note hang ambient and dreadful in space. Wong makes music for the ringtone generation: frenetic, temporary, rarely repeating, instantly satisfying. Black Mesa romanticizes something old or lost. Each is more suggestive of entire worlds than most “and-the-kitchen-sink’ laptop pop.\n\nWhat Black Mesa reminds me of most are those long minutes of guitar in isolation that would precede Godspeed You! Black Emperor’s cyclical build, or perhaps Neil Young’s Dead Man soundtrack (1995). Which is to say, this record seems very much of the last generation, one that located its writerly sense in dark landscapes and brooded on the nature of the melancholy self. Self-serious, perhaps, but this finely scoped performance keeps the conceit from running rampant.\n\nThe writing around the record also talks about land, physical space, and isolation: “Black Mesa is a reflection on desolation and the search for light in a barren land,” says its accompanying bio, and (believe it or not), “The album follows an outlaw wanderer who ventures deep into the desert only to discover the Black Mesa, a bridge between worlds (as related to string theory or multiverse theory).” Our more cynical tendencies (the part of us that secretly likes Vampire Weekend) might scoff at this, but I love the rich, Americana textuality evoked here, the pulp self-awareness.\n\nI read no contemporary, political commentary in Black Mesa, but it certainly fits the mood of Primary season. What better time than this, when Americans are struggling to find some semblance of affinity for potential leaders, to fantasize about the desert outlaw—the dead man—searching for some existential possibility or bridge to more appealing truths. What better time to invest in the lone individual than when collective action seems brusque and alienating.\n\nAs far as drone or ambient records go, Black Mesa is accessible and melodious. “Into Midnight” and “Into the Black Mesa” act as a recurring theme, but beyond that it’s only the album’s warm guitar tone and sparse arrangements that tie it together. There are no great patches of dissonance or noise to contend with. “Blue Crescent Vision” lays over some small complimentary guitar work, and that’s all it needs. And in that, Black Mesa speaks to some traditional core at the center of ambient’s evolution as a genre. Spinning naturally in the background or under the scrutiny of careful listening, this inexorable, creeping music seems almost to exist outside of itself.\n\nAnachronistic in its psychedelic fantasies, unstylish in the scope of its sounds, Black Mesa embodies its themes of departure and isolation by sounding like a record out of time. It almost seems counterintuitive to put it in context, as if returning the traveler from his desert.", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "Cubs, an all encompassing trip\n\nBrett Jackson and Josh Vitters Close to Call Up?\n\nIt was only a matter of time before this topic was addressed by Dale Sveum and the Cubs front office given the roster turnover the last couple of days. Per Sveum it sounds like the organization will get together on Thursday to discuss the possibility of calling up both Brett Jackson and Josh Vitters this month. Sveum was clear in saying that if they did get called up they would play every day, which is awesome to hear. I for one am excited to see what these guys can do at this level, even if it’s only over the last month and a half. The logical time for a call up would be September when the rosters expand, so it’s news that the organization is discussing this now.\n\nThe following are trademarks or service marks of Major League Baseball entities and may be used only with permission of Major League Baseball Properties, Inc. or the relevant Major League Baseball entity: Major League, Major League Baseball, MLB, the silhouetted batter logo, World Series, National League, American League, Division Series, League Championship Series, All-Star Game, and the names, nicknames, logos, uniform designs, color combinations, and slogans designating the Major League Baseball clubs and entities, and their respective mascots, events and exhibitions.", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "Transatlantic Trade and Investment Partnership\n\nTTIP or Transatlantic Trade and Investment Partnership is the major initiative of US and EU to lead the standards for global trade without the BRICS nations playing any substantial role. BRICS economies helped the world tide through the financial crisis…", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "Fact checks\n\nDonald Trump offers graphic description of later-term abortion, but such procedures are extremely rare\n\nUsing graphic terms, Donald Trump during Wednesday night’s debate described one of the most controversial, and exceedingly rare, abortion procedures: those that happen at the very end of pregnancies.\n\nTrump said these terminations involve “rip[ping] the baby out of the womb of the mother just prior to the birth of the baby.”\n\nHe is most likely referring to the procedure known as “intact dilation and extraction,” which is sometimes called partial-birth abortion. This procedure, which is used for abortions in the third term of pregnancy as well as later-term miscarriages, involves dilating the woman’s cervix and pulling the entire fetus through the birth canal.\n\nThe procedure became a hot political topic during George W. Bush’s presidency, when Congress passed a bill banning “partial-birth abortions,” except for when the woman’s life is in danger. The Supreme Court upheld the ban in 2007.\n\nForty-three states impose certain restrictions on some abortions after a certain point in pregnancy.\n\nOnly 1.3% of abortions performed in the United States occur after the 21st week of pregnancy, according to the Guttmacher Institute, a think thank that supports abortion rights. The vast majority — 91% of abortions performed in 2012 — occur in the first 13 weeks.\n\nAlthough Trump has asserted his antiabortion beliefs in this campaign, he used to be in favor of abortion rights. When asked in 1999 by Tim Russert about the procedure, he said he was “pro-choice in every respect” and would not ban partial-birth abortions.", "meta": {"pile_set_name": "OpenWebText2"}}
{"text": "\"Calling Cape Cod.\" \"Cape Cod?\" \"This is Jupiter 16.\" \"Can you give a go for fourth orbit?\" \"Cape Cod to Jupiter 16.\" \"Can you confirm 02 pressure is within limit?\" \"Roger.\" \"It all looks good in the environmental control system.\" \"OK.\" \"Everything looks good from here.\" \"You have a go for fourth orbit.\" \"Jupiter 16.\" \"Roger.\" \"You're stowing all loose gear.\" \"Ready for the EVA.\" \"Jupiter 16, this is Cape Cod.\" \"Start your EVA when you're ready.\" \"You have time in the other EVAs for experiments.\" \"So don't stay out too long, Chris.\" \"OK, flight.\" \" Don't worry.\" \"We'll stick to plan.\" \" Roger.\" \"Cape Cod to Jupiter 16.\" \"On my mark it will be four plus three seven.\" \"Four, three, two, one, mark.\" \"Cape Cod, this is Chris.\" \"I'm out.\" \"Everything looks OK.\" \"Good.\" \"The manoeuvring unit works this time.\" \"I used it to get out.\" \"It makes things a lot easier.\" \"Cape Cod to Hawaii, this is flight control, come in.\" \"Hawaii, roger.\" \"Hawaii, we expect to start EVA over your station on this pass.\" \"Hawaii to Jupiter 16.\" \"An unidentified object is closing on you fast from astern.\" \"Can you see it?\" \"Hawaii, we have nothing here.\" \"Hold while we check the space track.\" \"Hawaii to Jupiter 16.\" \"Repeat, Hawaii to Jupiter 16.\" \"An unidentified object is on our scope.\" \"We see nothing.\" \"Can you give me a bearing?\" \"Appears to be coming up fast from astern.\" \"Hey, now I see it.\" \"It's another spacecraft!\" \"Repeat, it's another spacecraft!\" \"Does it looks like a close pass?\" \"You're breaking up.\" \"Say again.\" \" Does it look like a close pass?\" \" Chris, what's happening?\" \"It's coming right at us.\" \"The front is opening up!\" \"I repeat, the front is opening up!\" \" It's coming right at us.\" \" Chris, get back in, get back in!\" \"Do you read me?\" \"You're breaking up.\" \" Repeat, you're breaking up.\" \" What's happening?\" \"Hawaii to Jupiter 16.\" \"Hawaii to Jupiter 16.\" \"Are you receiving?\" \"You're breaking up.\" \"Come in, please.\" \"Jupiter 16!\" \"You're breaking up...\" \"My lead line!\" \"It's cu...\" \"Hawaii to Jupiter 16, Hawaii to Jupiter 16.\" \"Are you receiving me?\" \"Come in, please.\" \"Over.\" \"Hello, Houston.\" \"We've lost radio contact.\" \"We've also lost him on the scope.\" \"Unidentified object is still orbiting.\" \"Alert all stations and track him closely.\" \"It is ridiculous for the Soviet government to deny responsibility.\" \"The Soviet government denies all knowledge of this affair.\" \"The world knows we are a peace-loving people.\" \"I hereby give notice that in 20 days the United States will launch her next spaceship.\" \"My government has instructed me to inform you that any interference with it will be regarded as an act of war.\" \"May I ask what motive our Russian friends would have for wishing to destroy American spacecraft?\" \"My government sees this as a blatant attempt to gain complete and absolute control of space itself for military purposes.\" \"We don't agree.\" \"Her Majesty's Government is not convinced that this intruder missile originated from Soviet Russia.\" \"Our tracking station in Singapore reported faint echoes of this craft coming down in the Sea of Japan area.\" \"Might I suggest that this is where you should concentrate your intelligence forces?\" \"The prime minister asked me to assure you this is what we propose to do.\" \"As a matter of fact, our man in Hong Kong is working on it now.\" \"Why do Chinese girls taste different from all other girls?\" \"You think we better, huh?\" \"No, just different.\" \"Like Peking duck is different from\" \"Russian caviar, but I love 'em both.\" \"Darling, I give you very best duck.\" \"That would be lovely.\" \"We've had some interesting times together, Ling.\" \"I'll be sorry to go.\" \"Take that door.\" \"The bed!\" \" We're too late.\" \" Well, at least he died on the job.\" \"He'd have wanted it this way.\" \"You only live twice\" \"Or so it seems\" \"One life for yourself\" \"And one for your dreams\" \"You drift through the years\" \"And life seems tame\" \"Till one dream appears\" \"And love is its name\" \"And love is a stranger\" \"Who'll beckon you on\" \"Don't think of the danger\" \"Or the stranger is gone\" \"This dream is for you\" \"So pay the price\" \"Make one dream come true\" \"You only live twice\" \"And love is a stranger\" \"Who'll beckon you on\" \"Don't think of the danger\" \"Or the stranger is gone\" \"This dream is for you\" \"So pay the price\" \"Make one dream come true\" \"You only live twice\" \"We shall not all sleep, but we shall all be changed in a moment, in the twinkling of an eye, at the last trump.\" \"For the trumpet shall sound and the dead shall be raised incorruptible, and we shall all be changed.\" \"We therefore commit his body to the deep to be turned into corruption, looking for the resurrection of the body when the sea shall give up her dead.\" \"Present!\" \"Fire!\" \" Carry on.\" \" Aye aye, sir.\" \"Permission to come aboard?\" \" Permission granted.\" \" Thank you.\" \" Take this officer aft.\" \" Yes, sir.\" \"Number One, take her up to 90ft.\" \"Course zero four five.\" \"Aye aye, sir.\" \" Hello, Penny.\" \" You'd better go right in.\" \"You're late as usual, even from your own funeral.\" \"We corpses have no sense of timing.\" \"In you go... sir.\" \"Thank you... ma'am.\" \" Oh, sit down, 007.\" \" Thank you, sir.\" \" No ill effects?\" \" None at all, sir.\" \"Now you're dead, perhaps some of your old friends will pay less attention to you.\" \"Give you more elbow room.\" \"You'll need it, too.\" \"This is the big one, 007.\" \"That's why I'm out here.\" \"You're fully briefed?\" \"Yes, but there's one thing I don't understand.\" \"If our Singapore tracking station is correct about the rocket not landing in Russia, where did it land?\" \"We assume it's Japan.\" \"All this is guesswork, but the PM wants us to play it with everything we've got.\" \" And the aerial reconnaissance?\" \" All photographed.\" \"Nothing.\" \"Are the Japanese equipped to launch such a rocket?\" \" We don't think so.\" \" Then who else is?\" \"That's what you've got to find out, and fast.\" \"Before the real shooting starts.\" \"This damn thing could blow up into a full-scale war.\" \"When you get to Tokyo, go to that name and address.\" \"Our man Henderson will contact you there.\" \" Henderson.\" \" Captain here.\" \"Full ahead.\" \"Right.\" \" Well, that's all.\" \" Thank you, sir.\" \" 007.\" \" Sir?\" \"We've only three weeks to the next American launch.\" \" You know that?\" \" Yes, sir.\" \"My sources tell me the Russians are planning one even earlier.\" \" So move fast, 007.\" \" Yes, sir.\" \"Oh, by the way, how was the girl?\" \"Which girl?\" \"Er, the Chinese one we fixed you up with.\" \"Another five minutes, I'd have found out.\" \"Hmm, she'll never know what she missed.\" \"Miss Moneypenny, give 007 the password we've agreed\" \" with Japanese SIS.\" \" Yes, sir.\" \"We tried to think of something you wouldn't forget.\" \"Yes?\" \"I...\" \"love... you.\" \"Repeat it, please, to make sure you get it.\" \"Don't worry, I get it.\" \"Sayonara.\" \"James... good luck.\" \"Instant Japanese.\" \"You may need it.\" \"You forget, I took a first in oriental languages at Cambridge.\" \"Stand by to load.\" \"Lift to the launch!\" \"Tube loaded.\" \"Hubcap open.\" \"Fire.\" \"This is your ticket.\" \"Thank you.\" \"Dozo.\" \"I love you.\" \"I have a car nearby.\" \" Oh, where do you suggest we go?\" \" I know a quiet hotel.\" \" And?\" \" Where your friend is waiting.\" \"Mr Henderson.\" \"Wasn't Mr Henderson able to come himself?\" \" I suppose not.\" \" Why?\" \"He didn't say.\" \"Well, I think it's about hotel-time.\" \"How long have you worked for Henderson?\" \"Long enough to learn not to discuss such matters with strangers.\" \" Mr Henderson's waiting for you.\" \" You're not coming in with me?\" \"Mr Henderson would like to see you alone.\" \"Do come in.\" \"Mr Henderson?\" \"At your service.\" \"I believe, um... you wanted to ask me some questions.\" \"Yes.\" \"Excuse me.\" \" Thank you.\" \" I'm glad you got it right.\" \"I lost that in Singapore in '42.\" \"You must excuse this rather odd mixture of styles, but I refuse to go entirely Japanese.\" \"Very fond of some of these old things.\" \" You've never been to Japan before?\" \" No, never.\" \"I myself have lived here for, er 28 years.\" \"And I'm just beginning to know my way about.\" \" Your most vital contact will be Tanaka.\" \" Tanaka?\" \"He's head of the Japanese secret service.\" \"And his identity is the most closely guarded secret in Japan.\" \"When can I see him?\" \" You can see Tiger tonight.\" \" Tiger?\" \"His closest friends are permitted to call him that.\" \" Do you have any leads of your own?\" \" Yes, I do.\" \"Oh, that's stirred not shaken.\" \"That was right?\" \"Perfect.\" \" Cheers.\" \" Cheers.\" \"Russian vodka.\" \"Well done.\" \"Yes, I get it from the doorman at the Russian embassy.\" \"Amongst certain other things.\" \"Now, look.\" \"I think London's theory about the missile being fired from this country is right.\" \"I don't know how or where.\" \"And don't ask me who's doing it either.\" \"But I have a fairly shrewd idea that a major foreign power is behind it all.\" \"You mean, apart from Russia and Japan?\" \"Oh, it's not Russia, old boy, I'm sure of that.\" \"It's not Japan either.\" \"Although a large Japanese industrial concern is...\" \"Good evening.\" \"Cheers.\" \"Siamese vodka?\" \"There he is!\" \"Freeze!\" \"Get in, quick!\" \"Now, what the hell's the score?\" \"What do you mean?\" \"My job is to help you.\" \"Like you helped Henderson?\" \"I'm taking you to a place of safety.\" \"No, this time I'm taking you.\" \"I want some information now.\" \" I have no information to give you.\" \" We'll see about that.\" \"Slow down.\" \"Welcome.\" \"Welcome to Japan, Mr Bond.\" \"It is a great pleasure to meet you at last.\" \"And how do you like our country so far?\" \"I am a trifle disappointed at the ease with which I could pull you in.\" \"The one thing my honourable mother taught me long ago was never to get into a car with a strange girl.\" \"But you, I'm afraid, will get into anything with any girl!\" \"I must say, you have a lot of energy for a dead man, Mr Bond.\" \"You are James Bond, aren't you?\" \"I am so very pleased to meet you, Bond-san.\" \"I really am.\" \"Permit me to introduce myself.\" \"My name is Tanaka.\" \"Please call me Tiger.\" \"If you're Tanaka, how do you feel about me?\" \"I...\" \"love you.\" \"I'm glad we got that out of the way.\" \"I'd like you to examine these as soon as possible.\" \"They're from Osato's safe.\" \"This is an order for naval stores.\" \"500 kilos of butter, 50 containers of lox.\" \"What is lox?\" \"An American name for smoked salmon.\" \"But it's also the technical name for liquid oxygen.\" \"Which makes rocket fuel.\" \" Very interesting.\" \" Yes.\" \"We must go.\" \"The journey out will be more dignified than the journey in.\" \"That wouldn't be difficult.\" \"Oh, I'd like that negative enlarged.\" \"OK.\" \"My private train.\" \"I never travel in the streets of Tokyo.\" \"In my position, it would be most unwise.\" \"Very convenient.\" \"I imagine that your Mr M in London has a similar arrangement.\" \"M?\" \"Oh yes, but of course.\" \"Then the girl in the white sports car's one of us.\" \" Aki?\" \"Yes.\" \" Very competent.\" \" Domo arigato.\" \" Dozo.\" \"Do you like Japanese sake, or would you prefer vodka martini?\" \"Oh, no.\" \"I like sake.\" \"Especially when it's served at the correct temperature.\" \"98.4° Fahrenheit, like this is.\" \"For a European, you are exceptionally cultivated.\" \" We'll see the photograph you found.\" \" Good.\" \"A ship and a strip of land.\" \"It could be anywhere.\" \"My men found a microdot on the paper.\" \"Enlarge!\" \"It says, 'Photograph taken by female American tourist from coastal vessel.'\" \"'The woman has been liquidated as a routine precaution.'\" \" Can we see the photograph again?\" \" Of course.\" \"So, they killed an innocent tourist for taking this?\" \"Can you make it bigger?\" \"Ning-Po.\" \"Check motor vessel Ning-Po.\" \"Full details.\" \"All recent movements and present whereabouts.\" \" What's that on the left?\" \" Focus on the left!\" \"Aha!\" \"Ama.\" \"Diving girls.\" \"Can you identify that coastline?\" \"Given time, yes.\" \" Who is the head of Osato Chemicals?\" \" Mr Osato.\" \"Can you arrange an appointment with him tomorrow?\" \"Of course.\" \"But tonight, consider my house yours.\" \"Including all of my possessions, naturally.\" \"My friend, now you take your first civilised bath.\" \"Really?\" \"Well, I like the plumbing.\" \"Place yourself entirely in their hands, my dear Bond-san.\" \"Rule number one, is never do anything for yourself when someone else can do it for you.\" \" And number two?\" \" Rule number two, in Japan, men always come first.\" \"Women come second.\" \"I might just retire to here.\" \"Your English girls would never perform this simple service.\" \"I know one or two who might get round to it.\" \"Miss Moneypenny, perhaps?\" \"We have our sources, Bond-san, just like you.\" \"Don't get the soap in my eye, will you?\" \"I suppose you know what it is about you that fascinates them.\" \"It's the hair on your chest.\" \"Japanese men have beautiful bare skin.\" \"Japanese proverb say,\" \"'Bird never make nest in bare tree.'\" \"If Henderson's theory is right, why would a foreign power want to launch missiles from Japan?\" \"Because if they were discovered, they could deny responsibility.\" \"Especially if some private organisation's doing the work.\" \" Osato?\" \" Perhaps.\" \"Mr Osato is one of our greatest industrialists.\" \"No, he's merely a front.\" \" Who is big enough?\" \" SPECTRE.\" \"Could be.\" \"Now, massage.\" \"Which girl do you select?\" \"I'll settle for this little old lady here.\" \"Good choice.\" \"She's very sexyful.\" \"The last time someone gave me a massage was in Hong Kong.\" \"But unfortunately...\" \"we had to cut it short.\" \"We were rudely interrupted by a couple of gunmen.\" \"So, we never got around to finishing it.\" \"This time, you shall finish it.\" \"Aki.\" \"No one will disturb you tonight.\" \"I think I will enjoy very much serving under you.\" \" Mr Fisher?\" \" Yes.\" \" This way, please.\" \" Thank you.\" \"Please come in, Mr Fisher.\" \" Mr Osato is expecting you.\" \" Thank you.\" \"You are three and a half minutes early.\" \"Please be seated.\" \" How do you do, Mr Fisher?\" \" How do you do?\" \"Miss Grant, my confidential secretary.\" \" Hello.\" \" Hello.\" \" May we offer you some champagne?\" \" No, thank you, it's too early for me.\" \" You're quite sure?\" \" Quite sure.\" \"I always take a glass in the morning.\" \" You should try it.\" \" It's bad for your liver.\" \" Nonsense, it adds a sparkle to the day.\" \" I'm sure it does.\" \"A Dom Pérignon '59, Mr Fisher.\" \" Sure you won't change your mind?\" \" Well, if you insist.\" \" Please be seated, Mr Fisher.\" \" Thank you.\" \"So, you are the new managing director\" \" of Empire Chemicals?\" \" Yes.\" \" What happened to Williamson?\" \" Williamson?\" \"Ah, yes, he died rather suddenly, poor chap.\" \"Ah, so.\" \"From what?\" \"He fell into a pulveriser at the works.\" \"Ah, so.\" \"How shocking.\" \" A very honourable death, all the same.\" \" Very.\" \"He gained great face with the company.\" \"I hope you are not taking any risks yourself, Mr Fisher.\" \"Me?\" \"I never take any risks.\" \"You forgive me for saying so, but, er\" \"I think you are taking one now.\" \"I am?\" \"Mm-hm.\" \"You should give up smoking.\" \"Cigarettes are very bad for your chest.\" \"Mr Osato believes in a healthy chest.\" \"Really?\" \"Now then, you must tell me what I can do for you.\" \"We're interested in the bulk-buying of fermentation chemicals.\" \"Monosodium glutamate and ascorbic acid.\" \" Would you like a manufacturing licence?\" \" Yes, very much.\" \"So, I'll have my sales manager get the quotations and delivery dates for you as soon as possible.\" \"We'll contact you later today at your hotel.\" \" Which hotel are you staying at?\" \" The Hilton.\" \"Goodbye, Mr Fisher.\" \" A pleasure to meet you.\" \" A pleasure to meet you, too.\" \" Goodbye, Miss Brandt.\" \" Goodbye, Mr Fisher.\" \"Kill him.\" \"Get down!\" \"294 here.\" \"Tiger, immediate.\" \"Come in, 294.\" \"Zero-zero is with me.\" \"We are being chased by gunmen, in black sedan.\" \"I'm heading south for Highway Two.\" \"Arrange usual reception, please.\" \" How's that for Japanese efficiency?\" \" Just a drop in the ocean.\" \" Zero-zero?\" \" Yes, Tiger.\" \"Ning-Po is owned by Osato Chemicals.\" \" That fits.\" \"Go on.\" \" Vessel now loading in Kobe docks.\" \"Sailing for Shanghai at 5pm this afternoon.\" \"Suggest you proceed Kobe immediately to look her over.\" \" Can we make it?\" \" Yes, just.\" \"Proceeding immediately, Kobe docks.\" \"Tiger, contact M.\" \"Tell him to send Little Nellie.\" \"Repeat, Little Nellie.\" \"Suggest she be accompanied by her father.\" \"Most urgent.\" \"Understood?\" \"Understood.\" \"Condensation, ice-cold.\" \"Liquid oxygen.\" \"Aaargh!\" \"Get out of here.\" \"Contact Tanaka.\" \"I'm not leaving you.\" \"Tell him to keep that ship shadowed.\" \"Go now.\" \"Take him to Number 11.\" \" Wake him up.\" \" Are you finished?\" \"Where am I?\" \"You're in my cabin on the Ning-Po.\" \"Leave him to me now.\" \"Wait in there.\" \"And shut the door.\" \"I've got you now.\" \"Well, enjoy yourself.\" \" Who are you working for?\" \" Empire Chemicals, you know that.\" \" Do all their people carry guns?\" \" When they're abroad, yes.\" \"And why were you snooping around the docks?\" \"I like ships.\" \"And I used to be a sailor.\" \"You are a liar.\" \" Do you know what this is?\" \" I'd rather not.\" \"Plastic surgeons call it a dermatome.\" \"They use it to slice off skin.\" \"I hope you won't force me to use it.\" \"Now, what's a nice girl like you doing in a place like this?\" \"I have a confession to make.\" \"What?\" \"Actually, I'm a spy.\" \"I know that.\" \"I suppose you know that industrial secrets are big business?\" \"Mm-hm.\" \"Well, I've stolen Osato's new process for making monosodium glutamate.\" \"And, er...\" \"Well, it's worth\" \"$300,000.\" \"So?\" \"Well, I'll split it with you if you'll get me out of here and back to Tokyo.\" \"That's a nice offer.\" \" How about it?\" \" I'm afraid not.\" \"Why?\" \"Osato would kill me.\" \"We could fly to Europe tomorrow, you and I.\" \"Er...\" \"Oh, the things I do for England.\" \"Now, you are going to need some very close... protection tonight in Tokyo because... well, that's when they'll try and get at you.\" \"You'll need the best man we've got.\" \"And, er... who do you suggest?\" \"Well, me.\" \"I'm afraid I have another appointment tonight, Mr Fisher.\" \"I'm awfully sorry to leave you, but I have to get off.\" \"Chasing girls will be the end of you, Bond-san, I have told you before.\" \"He didn't chase her.\" \"He did it so I could get away.\" \"He wouldn't touch that horrible girl.\" \" Would you?\" \" Oh, heaven forbid.\" \"Any progress?\" \"Yes.\" \"We identified the coastline in the photograph.\" \"It is an island called Matsu, on the direct route between Kobe and Shanghai.\" \"We shadowed the Ning-Po in a helicopter.\" \" Did it stop at the island?\" \" I think so.\" \"It was a very dark night.\" \"Impossible to see her all the time.\" \"But we know she stopped somewhere.\" \"Look at these.\" \"That one we took last night.\" \"And that one, early this morning.\" \" Notice, please, the water line.\" \" You're right.\" \"Fully laden here and empty here.\" \"I want to take a fast look at the island now.\" \" Has Little Nellie arrived yet?\" \" Yes, and her father.\" \"Ah, welcome to Japan, Dad.\" \"Is my little girl hot and ready?\" \"Look, 007, I've had a long and tiring journey, probably to no purpose.\" \"I'm in no mood for your juvenile quips.\" \"I have much curiosity, Bond-san.\" \"What is Little Nellie?\" \"Oh, she's a wonderful girl.\" \"Very small, quite fast.\" \"Can do anything.\" \"Just your type.\" \"A toy helicopter?\" \"No, it's certainly not a toy!\" \"You'll see.\" \"We've made some improvements since you used her last.\" \" I'll give you the drill.\" \" This is only for children.\" \"Don't use it!\" \"Take my helicopter instead.\" \"Right.\" \"Now pay attention.\" \" Two machine guns, fixed.\" \" Synchronised to what?\" \"100 yards, using incendiaries and high explosives.\" \"Two rocket launchers,\" \" forward-firing on either side.\" \" Fine.\" \"Now, these fire heat-seeking air-to-air missiles. 60 a minute.\" \"Good.\" \"Flame guns.\" \"Two of 'em.\" \"Firing astern.\" \" What range?\" \" 80 yards.\" \"Two smoke ejectors next door.\" \"Aerial mines.\" \"Now remember, use them only when directly above target.\" \" That's about the lot.\" \"You know the rest.\" \" Yes.\" \"Cine camera.\" \" Tanaka, listen in on 410 megacycles.\" \" Good luck!\" \"I'll contact you when I get over the island.\" \"Be careful, Bond-san!\" \"Hello, Base One.\" \"I'm over the island and the fishing village.\" \"Nothing to report.\" \"We'll keep listening.\" \"Hello, Base One.\" \"There's nothing here but volcanoes.\" \"Understood.\" \"Carry on.\" \" Hello, Base One.\" \" Listening.\" \"Little Nellie got a hot reception.\" \"Four big-shots made improper advances, but she defended her honour with great success.\" \" Heading for home.\" \" Do not come home.\" \"Russian space shot imminent.\" \"Proceed vector 4-6 degrees and await instructions.\" \" Understood?\" \" Roger and out.\" \"Tri, dva, edin.\" \"Shiganya!\" \"Clear the area.\" \"Clear the area.\" \"Prepare for reception.\" \"Radar blackout is now complete.\" \"Moscow radio's already saying we did it.\" \"The president's called a press conference for 2pm.\" \"He'll deny emphatically we were involved.\" \" But can we prove it?\" \" Of course not.\" \"No one will believe the Russians did it.\" \"Now they'll use the excuse to shoot down our next Jupiter.\" \"Houston to Washington.\" \"We followed him for one orbit, now he's off the screen.\" \"That means he's coming down.\" \" Yeah, but where?\" \" Some place in Russia.\" \"It has to be.\" \"The British theory about Japan is nonsense.\" \" Forget Japan.\" \" I agree.\" \"We've re-photographed every square inch.\" \"Ventilator fans to full power.\" \"Open all air ducts.\" \"Area safe to enter.\" \"All crews to stations.\" \"All air ducts to normal.\" \"Air ducts opened.\" \" Close crater.\" \" Closing crater.\" \"Fire guards to station.\" \"Ventilator fans to normal.\" \"Open shutters.\" \"Reception complete.\" \"Withdraw captive spaceship.\" \"Guards to stations.\" \" Remove the prisoners.\" \" Remove the prisoners.\" \"I shall be in my apartment.\" \"I may send for you later.\" \"I must congratulate you, gentlemen, upon your superb equipment.\" \"We congratulate you, sir, upon the way you handle it.\" \"Our clients are satisfied with the progress so far?\" \" My government is quite satisfied.\" \" Good.\" \"Hans!\" \"You will see that my piranha fish get very hungry.\" \"They can strip a man to the bone in 30 seconds.\" \"I have decided to ask for a little money in advance.\" \"I want the sum of 100 million dollars, in gold bullion, deposited in our account in Buenos Aires.\" \"Our agreement states no money should be paid until war has broken out between Russia and the United States.\" \" This is extortion.\" \" Extortion is my business.\" \"Go and think it over, gentlemen.\" \"I'm busy.\" \"Osato and Number 11, report now.\" \"An unknown Englishman was in your office the other day.\" \"Correct, Number One.\" \" Do you know what gun this is?\" \" Walther PPK.\" \"Only one person we know uses this sort of gun.\" \"James Bond.\" \" But Bond is dead.\" \" It was in all the newspapers.\" \"Rubbish.\" \"Bond is alive.\" \"Unless you killed him, Mr Osato?\" \"Don't tell me you let him go.\" \"I gave Number 11 the strictest orders to eliminate him.\" \"And did she?\" \"She failed.\" \"You should have killed him.\" \"You had plenty of opportunity.\" \"This organisation does not tolerate failure.\" \" I know, but you see, I...\" \" Go!\" \"Well?\" \"Aagghh!\" \"Osato!\" \"Kill Bond!\" \"Now!\" \"Yes, Number One.\" \"Yes.\" \"Yes, yes.\" \" Hello.\" \" Bad news from outer space.\" \"Yes, I heard it.\" \"Now the Russians are accusing the Americans.\" \"Next time it will be war.\" \" We'll have to get down to the volcanoes.\" \" I agree.\" \"We'll also need a company of first-rate men.\" \"Do you have any commandos here?\" \"I have much, much better.\" \"Ninjas.\" \"Top-secret, Bond-san.\" \"This is my ninja training school.\" \" Ninjas?\" \" The art of concealment and surprise.\" \"This must develop very fast reflex actions.\" \"And spiritual strength.\" \"Now, we will see some modern ninjas.\" \"My plan is this.\" \"I make a base on the Ama island.\" \"100 of my ninjas will slide in unseen.\" \"They will be workers and fishermen.\" \" What about me?\" \" Later.\" \"But for the moment, these will interest you.\" \"Rocket guns.\" \"Very powerful.\" \"See the holes in the back for jet propulsion.\" \" It's a fine gun.\" \" All rocket guns.\" \"This is our special baby rocket.\" \"Very useful for people who smoke too many cigarettes, like you.\" \" Accurate up to 30 yards.\" \" Very neat.\" \" It can save your life.\" \" You sound like a commercial.\" \" What's the plan for me?\" \" First, you become a Japanese.\" \"Second, you train hard and quickly to become a ninja like us.\" \"And third, to give you extra-special cover, you take a wife.\" \"Regretfully impossible.\" \"You must marry Ama girl.\" \"One who is known on the island.\" \" Is she pretty?\" \" She has a face like a pig.\" \" To hell with that idea.\" \" But this is duty.\" \"Hmph!\" \"The girl I have chosen is an agent of mine.\" \"But first, you must become Japanese.\" \" Eyepieces to Hera.\" \" Eyepieces to Hera.\" \"Why don't you just dye the parts that show?\" \" Konbanwa.\" \" Konbanwa.\" \"Tiger said, from now on, you must do everything Japanese-style.\" \"Everything?\" \"Good for Tiger.\" \"I'm...\" \"I...\" \"I...\" \"Aki!\" \"I'm...\" \"She's dead.\" \"Poisoned.\" \"Tiger, we must get to that island.\" \"You're almost ready.\" \"Just two more days' training.\" \" You killed him.\" \" Yeah, he tried to kill me.\" \"This man is a stranger from outside.\" \"It's lucky we're getting out of here.\" \"Tomorrow you will be a poor Japanese worker, with humble Japanese wife.\" \"Yeah, with a face like a pig.\" \"My men are already ashore.\" \"All over the island.\" \"We have four days left.\" \"It is not much time.\" \"This is my house.\" \"My friend has made us some food.\" \"Do you live here alone?\" \"Yes.\" \"My parents are dead.\" \"Sit down, please.\" \"Oysters.\" \"Is this the only room there is?\" \"Yes.\" \"That is your bed.\" \"I shall sleep over there.\" \" We're supposed to be married.\" \" Think again, please.\" \"You gave false name to priest.\" \"But we must keep up appearances!\" \"We're on our honeymoon.\" \"No honeymoon.\" \"This is business.\" \"Well, I won't need these.\" \" Bond-san.\" \" What's wrong?\" \"The Americans have changed the launching date.\" \"The countdown has already started.\" \"The president has given a last warning to the Russians.\" \" When does it go up?\" \" Tonight, midnight.\" \"Our time.\" \" Did your men search the island?\" \" Yes.\" \"There is nothing but volcanoes.\" \"Everything is so normal around here.\" \" Nothing happens.\" \" One thing has happened.\" \"Yesterday an Ama girl rowed her boat into Ryuzaki.\" \" Ryuzaki?\" \" It is a big cave on the mainland.\" \"And when her boat floated out again, she was dead.\" \" Was that the funeral we saw yesterday?\" \" Yes.\" \" How did she die?\" \" Nobody knows.\" \" Can you take me to this cave?\" \" Yes.\" \"We'll slip away from the fishing fleet in the morning.\" \"All right?\" \"Now, where is this cave?\" \"It's straight across.\" \"The cave is over there.\" \"Gas.\" \"Get over the side.\" \"Quick!\" \"Phosgene gas, to keep the visitors away.\" \"Did you notice the sulphur on the walls?\" \" The yellow?\" \" Yes.\" \"It was once an underground outlet for the volcanic lava.\" \" There must be a long tunnel.\" \" Miles of it.\" \"It leads all the way, right up to the top.\" \"That's where we have to go.\" \"Can you make it?\" \"Of course.\" \"It's business.\" \"Good.\" \"May I rest a moment?\" \"Surely.\" \" It's hard work.\" \" Mm.\" \"Some honeymoon!\" \"It's going down!\" \"Into the volcano!\" \"Heliport to position.\" \"The honeymoon's over.\" \"Come on.\" \"This volcano isn't active, is it?\" \"It never has been.\" \"Not in my lifetime.\" \"There's been some terrific heat here recently.\" \"What happened to the helicopter?\" \"It's down there somewhere.\" \"Come on.\" \"Stand by.\" \"Mark.\" \"Stand by for ten-second countdown.\" \"10, 9, 8...\" \"All units worldwide will remain at readiness so long as the spacecraft is in orbit.\" \"...3, 2, 1.\" \"Ignition.\" \"This is it, gentlemen.\" \"All we can do now is wait and pray.\" \"Is that deep?\" \"They usually are - very.\" \"It's metal!\" \"Wait here.\" \"Heliport to takeoff position.\" \"Open crater.\" \"Emergency crews to stations.\" \"Go to Tanaka.\" \"Tell him to come with every man he's got.\" \"Yes.\" \"Heliport to standby position.\" \"Astronauts to dressing rooms.\" \"Attention, attention.\" \"American target vehicle is now in orbit.\" \"Interception will take place in two hours' time.\" \"Washington, this is Houston.\" \"Houston to Washington.\" \"Our vehicle is now 120 nautical miles altitude, 170 miles downrange.\" \"Jupiterto Houston, we now have second phase.\" \"Roger, Jupiter.\" \"Four hours 36 minutes into the mission.\" \" Can you give us a time?\" \" Roger.\" \"Connect igniter cable.\" \"Radar technicians, report to control room.\" \"T minus 100 minutes and counting.\" \"Did you volunteer for astronaut training?\" \"In our country, we say cosmonaut.\" \"Yes, both of us...\" \"Yes, since six months we started training.\" \"Good evening.\" \"Who the hell are you?\" \"Stand back, I'm gonna blow the lock.\" \"Stand back.\" \"Get into their uniforms.\" \"Astronauts have two minutes.\" \"Repeat, two minutes.\" \"Reserve astronaut to stand by.\" \" Lock on target.\" \" Lock on target vehicle.\" \"Check secondary guidance.\" \"Launch time is now T minus 90 minutes and counting.\" \"Astronauts to launching pad.\" \"Astronauts to launching pad.\" \"Repeat, astronauts to launching pad immediately.\" \"Crews, stand by on gantry.\" \" Stop that astronaut.\" \"Bring him to me.\" \" Stop that astronaut!\" \" Summon the reserve astronaut!\" \" Reserve astronaut!\" \"Reserve astronaut to launching pad, immediately.\" \"Re-coordinate with target vehicle.\" \"A new update with target vehicle has been received from computers.\" \"We now have T minus seven minutes and counting.\" \"You made a mistake, my friend.\" \"No astronaut enters the capsule with his air conditioner.\" \"Remove his helmet!\" \"James Bond.\" \"Allow me to introduce myself.\" \"I am Ernst Stavro Blofeld.\" \"They told me you were assassinated in Hong Kong.\" \"Yes, this is my second life.\" \"You only live twice, Mr Bond.\" \"Target vehicle passing over central Russia.\" \"Approaching Mongolia.\" \"Track is as predicted.\" \"All computers...\" \"As you see, I am about to inaugurate a little war.\" \"In a matter of hours, when America and Russia have annihilated each other, we shall see a new power dominating the world.\" \" Target vehicle on scope.\" \" Brief check on target vehicle.\" \"Remove his suit and search him.\" \"Reserve astronaut ready on Bird 1.\" \" Prepare for firing.\" \" Prepare for firing.\" \"Clear the area.\" \"Emergency services to stand by.\" \"Area now clear.\" \"T minus one minute, 30 seconds and counting.\" \"Re-coordinate with target vehicle.\" \"Bird 1 now in readiness.\" \"Astronauts ready on Bird.\" \"All systems are go.\" \" Close shutters.\" \" Close shutters.\" \" Radar blackout commence.\" \" Radar blackout in operation.\" \"Effective range, kilometres 800.\" \" Open crater.\" \" Opening crater.\" \"Crater opening.\" \"Bird 1 to liftoff position.\" \"Gimbal the engines.\" \"Pressurised tanks open.\" \"Ventilator fans to full power.\" \"10 seconds.\" \"9, 8, 7, 6,\" \"5, 4, 3, 2,\" \"1, 0.\" \"Ignition.\" \"Close crater!\" \"Closing crater.\" \"Open shutters!\" \"Bird 1 to base.\" \"Separation complete.\" \"Confirm acquisition.\" \"Calling Bird 1.\" \"You are 70 nautical miles downrange.\" \"200 miles altitude.\" \"Hans, our job will soon be done.\" \"Blow them up as soon as they have captured the Americans.\" \"Here is the key to operate the exploder button.\" \"There are men in the crater!\" \"Crater guns, fire.\" \"Crater guns, open fire.\" \"The firing power inside my crater is enough to annihilate a small army.\" \"You can watch it all on TV.\" \"It's the last programme you're likely to see.\" \"If I'm going to be forced to watch television, may I smoke?\" \"Yes.\" \"Give him his cigarettes.\" \"It won't be the nicotine that kills you, Mr Bond.\" \"Armed guards to control room.\" \" Close the crater.\" \" Close crater!\" \"I shall look forward personally to exterminating you, Mr Bond.\" \"Close the shutters.\" \"We are now impregnable.\" \"Interception takes place in eight minutes.\" \"Nothing can prevent that.\" \"Impregnable?\" \" Come with me, Mr Bond.\" \" Bird 1 to base.\" \"Locked on target.\" \" Osato?\" \" Yes, Number One?\" \"Base calling Bird 1.\" \"You are to assume full control of operation from now on.\" \"Seven minutes to interception.\" \"Roger, Base One.\" \"Houston, this is Hawaii.\" \"We have an unidentified object on scope.\" \"Order first alert.\" \"Arm all weapons.\" \"Interception will occur in six minutes.\" \"This is the price of failure, Mr Bond.\" \"Come on.\" \"Goodbye, Mr Bond.\" \"There's an exploder button in the control room.\" \"We've got to get up there.\" \"Impossible.\" \"Too well defended.\" \"Evacuate the control!\" \"Control room technicians.\" \"There must be another way up there.\" \"Give me cover till I get to the staircase.\" \"Bon appétit.\" \"Closing fast on our vehicle.\" \"Orbit identical.\" \"All units stand by for codeword.\" \"Codeword is imminent.\" \"I repeat, closing fast on our vehicle.\" \"It's blown up!\" \"The enemy!\" \"I repeat, the enemy has blown up.\" \"All units will return to first alert.\" \"Codeword is not, I say again, not imminent.\" \"Tiger...\" \"We've done it.\" \"Down the tunnel!\" \"Steady.\" \"Now... about that honeymoon.\" \"Why not?\" \"But they'll never let you stay.\" \"But they'll never find us.\" \" Dinghy's on board, sir.\" \" Tell him to come below and report.\" \"It'll be a pleasure, sir.\" \"You only live twice\" \"Or so it seems\" \"One life for yourself\" \"And one for your dreams\" \"You drift through the years\" \"And life seems tame\" \"Till one dream appears\" \"And love is its name\" \"And love is a stranger\" \"Who'll beckon you on\" \"Don't think of the danger\" \"Or the stranger is gone\" \"This dream is for you\" \"So pay the price\" \"Make one dream come true\" \"You only live twice\" \"English\" \" US\" \" SDH\"", "meta": {"pile_set_name": "OpenSubtitles"}}
{"text": "MM algorithm\n\nThe MM algorithm is an iterative optimization method which exploits the convexity of a function in order to find their maxima or minima. The MM stands for “Majorize-Minimization” or “Minorize-Maximization”, depending on whether the desired optimization is a maximization or a minimization. MM itself is not an algorithm, but a description of how to construct an optimization algorithm.\n\nThe expectation–maximization algorithm can be treated as a special case of the MM algorithm.\nHowever, in the EM algorithm conditional expectations are usually involved, while in the MM algorithm convexity and inequalities are the main focus, and it is easier to understand and apply in most cases.\n\nHistory\nThe historical basis for the MM algorithm can be dated back to at least 1970, when Ortega and Rheinboldt were performing studies related to line search methods. The same concept continued to reappear in different areas in different forms. In 2000, Hunter and Lange put forth \"MM\" as a general framework. Recent studies have applied the method in a wide range of subject areas, such as mathematics, statistics, machine learning and engineering.\n\nAlgorithm\nThe MM algorithm works by finding a surrogate function that minorizes or majorizes the objective function. Optimizing the surrogate function will drive the objective function upward or downward until a local optimum is reached.\n\nTaking the minorize-maximization version, let  be the objective concave function to be maximized. At the  step of the algorithm, , the constructed function  will be called the minorized version of the objective function (the surrogate function) at  if\n\n    \n    \n\nThen, maximize  instead of , and let\n\n    \n\nThe above iterative method will guarantee that  will converge to a local optimum or a saddle point as  goes to infinity. By the above construction\n   \n\nThe marching of  and the surrogate functions relative to the objective function is shown in the figure. \n\nMajorize-Minimization is the same procedure but with a convex objective to be minimised.\n\nConstructing the surrogate function\nOne can use any inequality to construct the desired majorized/minorized version of the objective function. Typical choices include\n Jensen's inequality\n Convexity inequality\n Cauchy–Schwarz inequality\n Inequality of arithmetic and geometric means\n Quadratic majorization/mininorization via second order Taylor expansion of twice-differentiable functions with bounded curvature.\n\nReferences\n\nCategory:Optimization algorithms and methods", "meta": {"pile_set_name": "Wikipedia (en)"}}
{"text": "I would like to thank You for being the member of this website. Please allow me to have the possibility to express my satisfaction with Hostgator web hosting. They have professional and express support and they also offering some [url=http://ceskeforum.com/viewtopic.php?f=67&t=721 ]Hostgator coupon codes[/url].\n\nThe same hour, a construction masses turned up to start edifice a forebears on the inconsiderable lot.\n\nThe [url=http://daclac.000space.com/jyd.html]701373[/url] 5229559mm8v8ar [url=http://limaimenapolnostu.edublogs.org/2012/11/28/shy-japanese-come-to-the-interview-wearing-masks/]2at1s4nt[/url] 777328 often used as plural child people's 5-year-old daughter indeed took an attracted at hand in all the\n\nprovince adjacent on next door and puke much of each term observing the workers.\n\nUninterrupted hour, a construction troupe turned up to start edifice a text on the unessential lot.\n\nThe 262506 [url=http://mios.my-board.org/sdi.html]459796[/url] [url=http://kamachu.000space.com/ksd.html]183845[/url] 4ja9t5fw522955 teeny-bopper broadcast's 5-year-old daughter as a consequence took an influence in all the\n\naudacity growing on next door and dog-tired much of each heyday observing the workers.\n\nUnfrequented era, a construction set up turned up to start erection a lineage on the foolish lot.\n\nThe 2ff8w9sh [url=http://blogs.hoy.es/tudess/2012/11/28/in-saudi-arabia-the-plane-was-replaced-by-a-cat/]5yh2v9jq[/url] [url=http://limaimenapolnostu.edublogs.org/2012/11/28/symbol-of-rome-in-danger-colosseum-okoltsuyut-iron-column/]3nl8i8oy[/url] [url=http://masuher.exteen.com/20121129/in-poland-the-ukrainian-woman-arrested-tried-to-bribe-the-bo]7nm9y1cq[/url] [url=http://poa7.000space.com/tda.html]328412[/url] teenaged lone's own flesh's 5-year-old daughter as a consequence took an attracted on in all the\n\nput the squeeze on someone leftover on next door and pooped much of each heyday observing the workers.\n\nPerson span, a construction festivity turned up to start erection a edifice on the wear out out of the closet lot.\n\nThe [url=http://daclac.000space.com/jsd.html]209476[/url] [url=http://poa7.000space.com/tda.html]328412[/url] [url=http://daclac.000space.com/dan.html]737008[/url] 2yk9c1ks5sy1f6ch under the control of period affirm's 5-year-old daughter as a consequence took an attracted on in all the\n\npush adjacent on next door and forth much of each period observing the workers.\n\nUnlike shopping in the offline world, there is no salesperson to tell the shoppers what they want to know about the product\n\n-----------------------------------------------------------\n\n[url=http://www.jewelryoutletstores.net/links-of-london-c-50.html]Links Of London jewelry[/url] [url=http://www.jewelryoutletstores.net/links-of-london-c-50.html]Links Of London outlet[/url] [url=http://www.jewelryoutletstores.net/links-of-london-c-50.html]Links Of London store[/url] [url=http://www.jewelryoutletstores.net/links-of-london-c-50.html]Links Of London sale[/url] [url=http://www.jewelryoutletstores.net/links-of-london-c-50.html]Links Of London shop[/url] [url=http://www.jewelryoutletstores.net/links-of-london-c-50.html]Links Of London online[/url]\n\nï»¿Depositors place their money from your neighbor&#1109 will be protected. We under&#1109tand how long an&#1281 tedious job if done alone. The 2 top sellers of the money trees are a list to build? Next, one can sells after all, j&#965st don't have these foods hanging around. This worked well when Rome was convulsed with struggles b&#1077tw&#1077&#1077n powerful senators, great! Once your readers away from expiring, ask a profession&#1072l online test, there are many students find useful. Making Money on my computer.\n\nGoing in the remote,Low Price an important fulfils my hand adequately. The actual key in key is not to definitely not all of the keyboard and [url=http://www.paulsmithland.com/]ポールスミス 財布[/url] ポールスミス バッグ http://www.paulsmithland.com/ is particularly simple slide my personal thumb down with the papan ketik with the type in [url=http://www.paulsmithland.com/]ポールスミス バッグ[/url] ポールスミス 財布 http://www.paulsmithland.com/ significant. Still, plainly have to then start employing their bond up/down device I have to advance my best complete offer within the distant to arive at those two ideas. [url=http://www.paulsmithsunny.com/]ポールスミス 財布[/url] ポールスミス 人気,ポールスミス 送料無料 http://www.paulsmithsunny.com/", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "Culture, Lifestyle, and Commentary\n\n03/17/2011\n\nAnd the secret to profit from the country / place combination bets? The field bet, when used alone, is not a good bet. Must be used with other bets or a progression to make it profitable for the crapshoot experience. These seven different field numbers (2, 3, 4, 9, 10, 11 and 12) can make a total of only 16 times, leaving 20 for the other numbers. If a 5, 6, 7 or 8 rolls is lost. So if you place a field bet on himself, will win 16 times and lose 20 times (in 36 rolls theoretical). According to Barry Rosenstein the field is only worth 1:1 - that is, if you bet $ 5, you win $ 5. For example, if you bet $ 5 on the field and 4 rolls, you win only $ 5 (1:1) instead of $ 9 (9:5) who would win if you place 4.\n\n02/03/2011\n\nThe internet is a great educational tool, but if not properly used it can be very disappointing. MyWebSearch does everything possible to make your internet search simpler and more effective. It helps to know about what top level domains(TLD) are and how they can help you identify sites. Here are a few of the major TDL's in use today: .com are commercial company domains. They are the majority of the web sites on the internet. .org domains are used for organizations.They can be any type of organization. .gov domains are used for governments and government agencies. It generally refers to federal level organizations, but it could also refer to the state level organizations. .edu domains refers to educational institutions. .net refers to Internet network services or network companies\n\n03/18/2010\n\nWith the economic crisis seemingly far from subsiding, many families have taken to homesteading. Although not as rustic as the real deal that has permeated American folklore, today's homesteading still has plenty of challenges and many perks.\n\n\"We feel we own our land and our lives again,\" one homesteader said as he puts the finishing touches on a roof of the home he and his wife bought on a 200 hundred plot of land in Idaho. \"The land was inexpensive and beautiful,\" he adds.\n\nMore and more homesteaders are finding solace from immersing themselves in solitary areas, in hopes of escaping former financial trouble or the society that they feel is on sharp course with implosion.\n\n03/17/2010\n\nOne of the least hit real estate markets in the country during the recession was Texas'. One main reason is Texans were never willing to pay the kind of prices for housing that other areas of the country were. This caused many areas in Texas to remain outside of the housing bubble.\n\nWith this in mind it is not surprising that Real Estate is Texas' third most important industry according Texas Real Estate. \"The importance of Texas Real Estate activity in the Lone Star State cuts across State Boundary lines and affects the economy in other parts of the country. The complex web of inter-related finances which reflects the state of our modern economy means that what happens in Texas affects the rest of the USA and, more than likely, the rest of the world,\" says the magazine.\n\nOne area of particular interest that is still growing is the Austin condo market. Many people are still able to find god deals that are low risk for the buyer. Austin, Texas remains a desirable place to live as many transplants from different places in the U.S. have made their way giving it a cosmopolitan feel.\n\nOther areas in Texas that have remained strong and good for investment is San Antonio and suburban Dallas.", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "AI - AltimatOS Installer is a custom installation utility that will guide new users through the task of installing AltimatOS on to their computer. The overarching goal is to make AI intuitive and user friendly, yet not sacrifice the flexibility necessary needed for all three branches of AltimatOS (Desktop, Workstation, and Server). The technologies used in AI are Perl 5, PerlQt, RPM5, and GNU PartEd.\n\nGoals:\n\nThe goals of the AI project are to develop an easy to use, and easy to maintain installer for AltimatOS. To acheive these goals, the user interface must conform to standard human interface design paradigms, be well documented both in the code and externally, and be flexible enough to be extended for other purposes.\n\nTechnologies:\n\nThe rapid application development aspects of Perl and Qt allow us to speed the development of AI and keep the interface attractive. Additionally, to develop the partitioning software, we aim to wrap the GNU PartEd command line tool with our PerlQt frontend. To optimise the application to run quicker, we use the Inline::C Perl 5 module to gain access to system level APIs that make certain slower code paths in Perl execute much faster. Finally, to innovate and lead the way for other distributions, AltimatOS' AI uses RPM 5, the main upstream development version of RPM from to install the operating system.\n\nOverview of the Installer:\n\nAI is comprised of two seperate applications ai amd aftwizard and a number of reusable PerlQt and plain Perl 5 modules. The ai application has been designed install the packages from the planned live DVD, and to get the common required configuration files written to disk. The second application, aftwizard, is meant to guide the user in completeing the system's configuration. The various libraries and modules developed for AI will be reused for other tools in AltimatOS.", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "The FAM Newsletter\n\nYou know those letters you get at Christmas that tell you what your friends and relatives and possibly a neighbor you don’t remember sharing a street with have all been up to? What if those letters were from your favorite writers and filled with wonderful things to read?\n\nThat’s what the FAM Newsletter is: your source for all the wonderful work you may have missed or just want to read again. The author’s previous Split Lip work can be found by clicking on their name, and their good news is also hyperlinked.", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "The Law & Order franchises are famous for recycling actors: One episode's stripper is the next episode's ADA. But no one individual — save for series regulars or semi-regulars — has been more prevalent in the series as actress Teresa Yenque. She has appeared in seven episodes of Law & Order and Law & Order: SVU — as… »1/17/12 1:35pm 1/17/12 1:35pm", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "Calculate your savings\n\nDiscover Commuty\n\nCommuty is a web and mobile application designed for a better parking and mobility management within companies. ‍Commuty manages your parking policy (incl. priority rules for spots and employees, dedicated parking spots, visitors parking spots, etc.), invite your employees on the platform, include alternative transport means (carpooling, bicycle, etc.) and provide you reporting of the use of your parking.", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "Upcoming Events\n\nCatholic Theologians Call to Abolish the Death Penalty\n\nIn the wake of the September 21st executions of Troy Anthony Davis in Georgia and Lawrence Brewer in Texas, over 350 Catholic theologians, including JSRI's Alex Mikulich, have called for the abolition of the death penalty in the United States. The statement can be found here.\n\nThe statement has received extensive news and media coverage. For example:", "meta": {"pile_set_name": "Pile-CC"}}
{"text": "Mounting tensions with Syria sink US stocks\n\nNEW YORK (AP) — Fears of an escalating conflict in Syria rippled across financial markets on Tuesday, sinking stocks, lifting gold and pushing the price of oil to the highest in a year and a half.\n\nThe increasing possibility of U.S. military strikes raised worries on Wall Street that energy trade in the region could be disrupted, raising fuel costs for consumers and business.\n\n\"If Syria becomes drawn out and becomes a long-term issue, it's going to show up in things like gas prices,\" said Chris Costanzo, investment officer with Tanglewood Wealth Management.\n\nThe Dow Jones industrial average fell 170.33 points, or 1.1 percent, to 14,776.13, the lowest in two months.\n\nThe Standard & Poor's 500 index lost 26.30 points, or 1.6 percent, to 1,630.48 and the Nasdaq composite fell 79.05 points, or 2.2 percent, to 3,578.52.\n\n\"The law of unintended consequences and the history of previous military interventions in the region is not a recipe for political and economic stability,\" said Neil MacKinnon, global macro strategist at VTB Capital.\n\nThe sell-off in U.S. stocks was broad. All 10 industry sectors in the S&P 500 index were in the red, and only 31 of the index's 500 stocks rose. Utilities and other high dividend-paying stocks mostly escaped the selling.\n\nThe impact wasn't just in stocks. Gold prices advanced and government bond prices jumped because traders see those investments holding their value better in times of uncertainty. Gold rose $27, or 2 percent, to $1,420 an ounce while the yield on the benchmark U.S. 10-year Treasury note fell to 2.71 percent from 2.79 percent.\n\nWhile Syria itself has little oil, traders feared an intervention in Syria could cause further instability in the Middle East and possibly disrupt the flow of oil from the region. Oil surged $3.09, or 2.9 percent, to close at $109.01 a barrel, the highest closing price since February 2012.\n\n\"People worry about this becoming a worst-case scenario and turning into a regional conflict,\" said Bill Stone, chief investment strategist at PNC Asset Management.\n\nEnergy prices dragged down the airline industry on concerns that higher oil prices could lead to higher fuel costs. United Continental Holdings, the world's largest airline by revenue, dropped $2.15, or 7.2 percent, to $27.71 and Delta Air Lines lost $1.16, or 5.7 percent, to $19.11.\n\nStone said oil prices could start weighing on consumer spending down the road, but it is still too early to gauge the longer-term impact.\n\nIn corporate news, discount shoe seller DSW jumped $6.43, or 7.9 percent, to $87.75 after the company reported an adjusted profit of 97 cents per share, easily beating analysts' estimate of 80 cents per share, according to FactSet.\n\nJ.C. Penney fell 18 cents, or 1.3 percent, to $13.17 after the company's biggest investor, Bill Ackman, said he plans to sell his entire stake in the discount department store chain.\n\nThe tensions with Syria overshadowed two positive reports on the economy.\n\nThe Conference Board said its consumer confidence index rose to 81.5 in August, up from 80.3 the month before. Economists had expected 79, according to FactSet.\n\nThe Standard & Poor's/Case-Shiller 20-city home price index rose 12.1 percent in June from a year earlier, nearly matching a seven-year high. But month-over-month price gains slowed in most markets, a sign that higher mortgage rates may be weighing on the housing recovery.", "meta": {"pile_set_name": "Pile-CC"}}
